const Abu = require('../events');
const {MessageType, MessageOptions, Mimetype} = require('@adiwajshing/baileys');
const axios = require('axios');
const Config = require('../config');
const fs = require('fs');
const got = require('got');
const config = require('../config');
const Language = require('../language');
const Lang = Language.getString('wallpaper');

Abu.addCommand({pattern: 'list', fromMe: false, desc: 'command help menu'}, (async (message, match) => {

    var r_text = new Array ();
    
    r_text[0] = Config.LG_LOGO
    
    var i = Math.floor(1*Math.random())

    var respoimage = await axios.get(`${r_text[i]}`, { responseType: 'arraybuffer' })

    await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.jpg, contextInfo: {mentionedJid: message.mention}, caption: `
   ` + config.LOGO_NAME + `
   
┏╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍┓ 
      ☆ ` + config.BOT + ` ☆ 
 ┗╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍┛ 
 ┏╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍┓ 
 ┣⍟ 
 ┣⍟🌹 ᴅᴇᴠᴇʟᴏᴘᴇʀ :` + config.OA_NAME + ` 
 ┣⍟🌹 ʙᴏᴛ :` + config.BOT + `
 ┣⍟🌹 ᴠᴇʀsɪᴏɴ : 2.0 
 ┣⍟🌹 ᴍᴏᴅᴇ : ᴘᴜʙʟɪᴄ 
 ┣⍟🌹 ᴘʀᴇғɪx : [] 
 ┣⍟ 
 ┣⍟     ▎▍▌▌▉▏▎▌▉▐▏▌▎
 ┣⍟     ▎▍▌▌▉▏▎▌▉▐▏▌▎ 
 ┣⍟         ©ᴛᴇᴀᴍ ` + config.BOT + ` 
 ┣⍟ 
 ┗╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍┛ 
 ⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟ 
 ┏╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍┓ 
 ┣⍟        ◩ ᴍᴇɴᴜ ◪ 
 ┗╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍┛ 
 ⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟ 
 ┏╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍┓ 
 ┣⍟ 
 ┣⍟ ✩[ 𝙼𝙴𝙳𝙸𝙰 ]✩ 
 ┣⍟ 
 ┣⍟𝕾⃝🌼 sᴏɴɢ 
 ┣⍟𝕾⃝🌼 ᴠɪᴅᴇᴏ 
 ┣⍟𝕾⃝🌼 ɪɴsᴛᴀ 
 ┣⍟𝕾⃝🌼 ʏᴛ 
 ┣⍟𝕾⃝🌼 ғɪɴᴅ 
 ┣⍟𝕾⃝🌼 sɪɴɢ 
 ┣⍟ 
 ┣⍟ ✩[ 𝙲𝙾𝙽𝚅𝙴𝚁𝚃 ]✩ 
 ┣⍟ 
 ┣⍟𝕾⃝🌼 ɢɪғ 
 ┣⍟𝕾⃝🌼 ᴍᴘ3 
 ┣⍟𝕾⃝🌼 ᴍᴘ4 
 ┣⍟𝕾⃝🌼 ᴜɴᴠᴏɪᴄᴇ 
 ┣⍟𝕾⃝🌼 ᴛᴛs 
 ┣⍟𝕾⃝🌼 ɪᴍɢ 
 ┣⍟𝕾⃝🌼 sᴛɪᴄᴋᴇʀ 
 ┣⍟𝕾⃝🌼 ᴀᴛᴛᴘ 
 ┣⍟𝕾⃝🌼 ᴛᴛᴘ 
 ┣⍟𝕾⃝🌼 ғᴀᴛᴘ 
 ┣⍟𝕾⃝🌼 ᴄᴏᴅᴛᴛᴘ 
 ┣⍟𝕾⃝🌼 ᴘʜᴏᴛᴏ 
 ┣⍟𝕾⃝🌼 ɪᴍɢ 
 ┣⍟𝕾⃝🌼 ᴊɪᴅ 
 ┣⍟𝕾⃝🌼 ʙʀᴅᴍᴏʀᴇ 
 ┣⍟𝕾⃝🌼 ʀᴅᴍᴏʀᴇ 
 ┣⍟𝕾⃝🌼 ᴅᴇᴛᴇᴄᴛʟᴀɴɢ 
 ┣⍟𝕾⃝🌼 ᴄᴜʀʀᴇɴᴄʏ 
 ┣⍟𝕾⃝🌼 sᴡᴇᴀᴛʜᴇʀ 
 ┣⍟𝕾⃝🌼 ᴡᴀᴍᴇ 
 ┣⍟𝕾⃝🌼 ᴄᴀʟᴄ 
 ┣⍟ 
 ┣⍟ ✩[ 𝙼𝙰𝙺𝙴𝚁 ]✩ 
 ┣⍟ 
 ┣⍟𝕾⃝🌼 xᴍᴇᴅɪᴀ 
 ┣⍟𝕾⃝🌼 ᴄᴀʀʙᴏɴ 
 ┣⍟𝕾⃝🌼 ғғɪʀᴇ 
 ┣⍟𝕾⃝🌼 ᴇᴍᴏ 
 ┣⍟𝕾⃝🌼 ᴍᴏʀᴇᴛxᴛ 
 ┣⍟𝕾⃝🌼 ᴍᴍᴘᴀᴄᴋ 
 ┣⍟𝕾⃝🌼 ᴍᴀᴋᴇʀᴍᴇɴᴜ 
 ┣⍟𝕾⃝🌼 ᴛxᴛɪᴛ 
 ┣⍟𝕾⃝🌼 ʀᴀɴᴅᴏᴍ 
 ┣⍟𝕾⃝🌼 ɢᴅᴍʀɴɢ 
 ┣⍟𝕾⃝🌼 ɢᴅɴɪ8 
 ┣⍟ 
 ┣⍟ ✩[ 𝙵𝚄𝙽 ]✩ 
 ┣⍟ 
 ┣⍟𝕾⃝🌼 ᴀᴅᴀɴ 
 ┣⍟𝕾⃝🌼 ᴊᴏᴋᴇ 
 ┣⍟𝕾⃝🌼 ᴍᴏʟᴜ 
 ┣⍟𝕾⃝🌼 ᴍᴇᴍᴇ 
 ┣⍟𝕾⃝🌼 ǫʀ 
 ┣⍟𝕾⃝🌼 ᴀɴɪᴍᴇsᴀʏ 
 ┣⍟𝕾⃝🌼 ᴄʜᴀɴɢᴇsᴀʏ 
 ┣⍟𝕾⃝🌼 ᴛʀᴜᴍᴘsᴀʏ 
 ┣⍟𝕾⃝🌼 ᴄᴏᴍᴘʟɪᴍᴇɴᴛ 
 ┣⍟ 
 ┣⍟ ✩[ 𝚂𝙴𝙰𝚁𝙲𝙷 ]✩ 
 ┣⍟ 
 ┣⍟𝕾⃝🌼 ᴡɪᴋɪ 
 ┣⍟𝕾⃝🌼 ɴᴇᴡs 
 ┣⍟𝕾⃝🌼 ᴄᴏᴠɪᴅ 
 ┣⍟𝕾⃝🌼 ʟʏʀɪᴄ 
 ┣⍟𝕾⃝🌼 sʜᴏᴡ 
 ┣⍟𝕾⃝🌼 ᴍᴏᴠɪᴇ 
 ┣⍟𝕾⃝🌼 ᴡᴇᴀᴛʜᴇʀ 
 ┣⍟𝕾⃝🌼 ᴅɪᴄᴛ 
 ┣⍟𝕾⃝🌼 sʜᴏʀᴛ 
 ┣⍟𝕾⃝🌼 sᴄᴀɴ 
 ┣⍟ 
 ┣⍟ ✩[ 𝚃𝙰𝙶 ]✩ 
 ┣⍟ 
 ┣⍟𝕾⃝🌼 ᴛᴀɢᴀʟʟ 
 ┣⍟𝕾⃝🌼 ᴛᴀɢᴀᴅᴍɪɴ 
 ┣⍟ 
 ┣⍟ ✩[ 𝙾𝚃𝙷𝙴𝚁 ]✩ 
 ┣⍟ 
 ┣⍟𝕾⃝🌼 ᴀɴɪᴍᴇ 
 ┣⍟𝕾⃝🌼 ᴡᴀʟʟᴘᴀᴘᴇʀ 
 ┣⍟𝕾⃝🌼 ss 
 ┣⍟𝕾⃝🌼 ᴛʀᴛ 
 ┣⍟𝕾⃝🌼 ʀᴇᴍᴏᴠᴇʙɢ 
 ┣⍟𝕾⃝🌼 ᴀᴘᴋᴍᴏᴅ 
 ┣⍟𝕾⃝🌼 ʜᴍᴏᴅ 
 ┣⍟𝕾⃝🌼 ɴᴏᴛᴇs 
 ┣⍟𝕾⃝🌼 sᴀᴠᴇ 
 ┣⍟𝕾⃝🌼 ᴅᴇʟᴇᴛᴇɴᴏᴛᴇs 
 ┣⍟𝕾⃝🌼 ɪɴsᴜʟᴛ 
 ┣⍟𝕾⃝🌼 ǫᴜᴏᴛᴇ 
 ┣⍟𝕾⃝🌼 sʏsᴅ 
 ┣⍟𝕾⃝🌼 ᴡᴇᴀᴛʜᴇʀ 
 ┣⍟𝕾⃝🌼 sᴘᴇᴇᴅᴛᴇsᴛ 
 ┣⍟ 
 ┣⍟ ✩[ 𝙶𝚁𝙾𝚄𝙿 𝙲𝙼𝙽𝙳𝚂 ]✩ 
 ┣⍟ 
 ┣⍟𝕾⃝🌼 ᴀᴅᴅ 
 ┣⍟𝕾⃝🌼 ʙᴀɴ 
 ┣⍟𝕾⃝🌼 ᴘʀᴏᴍᴏᴛᴇ 
 ┣⍟𝕾⃝🌼 ᴅᴇᴍᴏᴛᴇ 
 ┣⍟𝕾⃝🌼 ᴡᴇʟᴄᴏᴍᴇ 
 ┣⍟𝕾⃝🌼 ɢᴏᴏᴅʙʏᴇ 
 ┣⍟𝕾⃝🌼 ᴍᴜᴛᴇ 
 ┣⍟𝕾⃝🌼 ᴜɴᴍᴜᴛᴇ 
 ┣⍟𝕾⃝🌼 ʀᴇɴᴀᴍᴇ 
 ┣⍟𝕾⃝🌼 ɪɴᴠɪᴛᴇ 
 ┣⍟𝕾⃝🌼 ᴀɴᴛɪʟɪɴᴋ 
 ┣⍟𝕾⃝🌼 ᴛʜᴇʀɪ [ɴᴏ-ʏᴇs] 
 ┣⍟𝕾⃝🌼 ᴛᴇʀɪ [ᴄᴍɴᴅ,ᴄᴍɴᴅ] 
 ┣⍟𝕾⃝🌼 ʀᴇᴘᴏʀᴛ 
 ┣⍟𝕾⃝🌼 ʀᴇsᴇᴛ ᴡᴀʀɴ 
 ┣⍟𝕾⃝🌼 ᴡʜᴏɪs 
 ┣⍟ 
 ┣⍟ ✩[ 𝙾𝚆𝙼𝙴𝚁 𝙲𝙼𝙽𝙳𝚂 ]✩ 
 ┣⍟ 
 ┣⍟𝕾⃝🌼 ᴜᴘᴅᴀᴛᴇ 
 ┣⍟𝕾⃝🌼 ᴜᴘᴅᴀᴛᴇ ɴᴏᴡ 
 ┣⍟𝕾⃝🌼 ғᴜʟʟᴇᴠᴀ 
 ┣⍟𝕾⃝🌼 ᴀᴜᴛᴏʙɪᴏ 
 ┣⍟𝕾⃝🌼 sᴇᴛᴠᴀʀ 
 ┣⍟𝕾⃝🌼 ᴅᴇʟᴠᴀʀ 
 ┣⍟𝕾⃝🌼 ᴀʟʟᴡᴀʀ 
 ┣⍟𝕾⃝🌼 ʙɢᴍ [ᴏɴ-ᴏғғ] 
 ┣⍟𝕾⃝🌼 sᴛɪᴄᴋᴇʀ [ᴏɴ-ᴏғғ] 
 ┣⍟𝕾⃝🌼 sᴜᴅᴏ 
 ┣⍟𝕾⃝🌼 ᴄᴀᴘᴛɪᴏɴ 
 ┣⍟𝕾⃝🌼 ʜᴀɴᴅʟᴇʀs 
 ┣⍟𝕾⃝🌼 ʙᴏᴛɴᴀᴍᴇ 
 ┣⍟𝕾⃝🌼 ᴀ [ᴊɪᴅ] 
 ┣⍟𝕾⃝🌼 ᴘɪɴɢ 
 ┣⍟ 
 ┣⍟ ✩[ 𝙼𝙾𝚁𝙴 𝙸𝙽𝙵𝙾 ]✩ 
 ┣⍟ 
 ┣⍟🎲 ʟɪsᴛ 
 ┣⍟🎲 ᴏᴡɴᴇʀ 
 ┣⍟🎲 ɢɪᴛ 
 ┣⍟🎲 ᴀʟɪᴠᴇ 
 ┣⍟ 
 ┣⍟ ✩[ 𝙲𝚁𝙴𝙰𝚃𝙴𝚁𝚂 ]✩ 
 ┣⍟ 
 ┣⍟🌹 ` + config.OWNER + `
 ┣⍟ 
 ┣⍟    ❏` + config.ALL + `❏ 
 ┗╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍┛ 
 ┏╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍┓ 
 ┣⍟      ◩ ♥︎𝚃𝙷𝙰𝙽𝙺𝚂♥︎ ◪ 
 ┗╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍┛
